{
  "backend/main.mo": "Main actor implementing a news/social platform with user profiles, posts, comments, likes, and role-based access control using authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old user profiles to new format by adding a default 'commonUser' role field to existing profiles.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including role selection, homepage/news page separation, verified user filtering, profile photo upload, and routing updates.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, including pages, components, hooks, and configuration files for the Sanchaari educational platform.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for the application's design tokens.",
  "frontend/index.html": "HTML entry point for the React application with title 'Sanchaari' and root div mounting point.",
  "frontend/src/App.tsx": "Main application component with TanStack Router setup, authentication guards, profile guards, and route definitions for all pages including home, news, resources, and profile.",
  "frontend/src/components/CreatePostForm.tsx": "Post creation form component with title, content, and optional image URL inputs using useCreatePost mutation with validation and loading states.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, bottom navigation bar (Home, Updates, Resources, Profile), and authentication controls using Internet Identity. Handles login/logout and highlights active navigation items.",
  "frontend/src/components/ProfilePhotoUpload.tsx": "Profile photo upload component with drag-and-drop support, file validation (5MB max, image types only), preview display, and progress tracking. Uses ExternalBlob for uploading to backend.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous actors. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides status tracking (initializing, logging-in, success, error) and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management (get, register, update), news posts (get all, get by ID, create, delete), and comments (get for post, add). All hooks use the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar). Includes base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/HomePage.tsx": "Displays a feed of all community posts with create post form for authenticated users, post cards showing author info, content preview, engagement metrics (likes, comments, shares), and save/unsave functionality.",
  "frontend/src/pages/NewsPage.tsx": "Shows filtered feed of posts only from verified users, with create post form restricted to verified users and a notice for non-verified users explaining verification requirements.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays full post details with complete content, engagement actions (like, share, save), and a comment section where authenticated users can view and add comments.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing profile information with editable display name, profile photo upload dialog, and a list of saved posts with engagement metrics.",
  "frontend/src/pages/RegisterPage.tsx": "Registration form for new users to create a profile by entering username, display name, and selecting a role from predefined options (common user, author, group head, etc.).",
  "frontend/src/pages/ResourcesPage.tsx": "Static page showcasing upcoming study resources for government job exam preparation, displaying resource categories and subject coverage areas with a 'coming soon' notice.",
  "frontend/src/pages/TestResultPage.tsx": "Empty file with no content.",
  "frontend/src/pages/TestsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/TestTakingPage.tsx": "Empty file with no content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, animations, and custom design tokens for a component library with sidebar, chart, and card variants.",
  "project_state.json": "Project state document for Sanchaari, a social learning platform for government job exam preparation with role-based users, dual feeds (Home/Updates), study resources, mock tests, verification badges, and unique username enforcement."
}