{
  "backend/main.mo": "Main actor module implementing a news/social platform with user profiles, posts, comments, likes, and role-based access control using mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module defining data types (NewsPost, Comment, UserProfileV2, UserRole) and actor state structure for upgrade persistence.",
  "feature_evidence.json": "Empty feature evidence report with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing summaries of all frontend TypeScript/React components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the application.",
  "frontend/index.html": "HTML entry point with title 'Sanchaari' and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication guards, profile guards, and route definitions including admin dashboard.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with title, content, and optional image URL fields using React Query mutation.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, authentication button, and bottom navigation bar that conditionally shows admin link for administrators.",
  "frontend/src/components/ProfilePhotoUpload.tsx": "A React component for uploading profile photos with drag-and-drop support, file validation (5MB max, image types only), preview display, and progress tracking using ExternalBlob for upload.",
  "frontend/src/components/UserManagementTable.tsx": "An admin table component for managing users with search/filter capabilities, role assignment, verification status management, and a modal for viewing detailed user profiles.",
  "frontend/src/components/UserProfileModal.tsx": "A modal dialog component that displays detailed user profile information including avatar, role, verification status, bio, joined date, and a list of posts authored by the user.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with an admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for managing Internet Identity authentication, handling login/logout flows, identity persistence, and providing authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for all backend operations including user profile management, post CRUD operations, comments, bookmarks, likes, user role management, and verification status using the actor instance.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, destructive, etc.) and typography styles for headings.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that checks if the current user has admin privileges and displays a UserManagementTable component for managing users, roles, and verification status, or shows an access denied message.",
  "frontend/src/pages/HomePage.tsx": "Main feed page displaying all community posts with create post form for authenticated users, post cards with like/comment/share/save actions, and timestamp formatting utilities.",
  "frontend/src/pages/NewsPage.tsx": "Updates/news feed page that filters and displays only posts from verified users, with create post functionality restricted to verified users and similar post interaction features as HomePage.",
  "frontend/src/pages/PostDetailPage.tsx": "Individual post detail view showing full post content, comments section with nested CommentItem components, and interaction buttons (like, share, save) with comment submission functionality for authenticated users.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying profile information with editable display name, profile photo upload dialog, and a list of saved posts with preview cards and interaction stats.",
  "frontend/src/pages/RegisterPage.tsx": "User registration page with form for username, display name, and role selection; validates input and calls useRegisterUser mutation to create a new user profile.",
  "frontend/src/pages/ResourcesPage.tsx": "Static resources page displaying a 'coming soon' notice and showcasing planned study materials categories (study materials, video lectures, practice papers, reference books) and subject coverage for government job exam preparation.",
  "frontend/src/pages/TestResultPage.tsx": "Empty file placeholder for test results display functionality.",
  "frontend/src/pages/TestsPage.tsx": "Empty file placeholder for tests listing/browsing functionality.",
  "frontend/src/pages/TestTakingPage.tsx": "Empty file placeholder for test-taking interface functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), typography, container queries, animations, and design tokens for a component-based UI system.",
  "project_state.json": "Project metadata defining Sanchaari as a social learning platform for government job exam preparation with role-based users, dual feeds (Home/Updates), profile management, and phased admin dashboard implementation."
}